# Написати програму, яка розраховує оподаткування на основі річного доходу користувача.
#
# Отримайте річний дохід користувача.
# Ми припускаємо, що користувач ЗАВЖДИ буде вводити нормальне число (≥0)
# На основі введеного доходу розрахуйте податок за такими умовами:
# Якщо дохід менше ніж 10 000 грн, податок складає 10% від доходу.
# Якщо дохід від 10 000 до 50 000 грн, податок складає 15% від доходу.
# Якщо дохід більше ніж 50 000 грн, податок складає 20% від доходу.
# Запишіть результат у змінну tax_amount.

def calculate_tax(user_income):

    tax_amount = 0

    if user_income < 10000:
        tax_amount += user_income * 0.1
    elif 10000 < user_income < 50000:
        tax_amount += user_income * 0.15
    elif user_income >= 50000:
        tax_amount += user_income * 0.2
    else:
        print("Unexpected condition")

    return tax_amount

print(calculate_tax(50000))



# Ваша задача - написати функцію, яка визначає, чи є введене користувачем число простим чи складеним.
# Зазначте, що користувач завжди буде вводити цілі числа.
#
# Простим вважаємо число, яке має 2 дільники - одиницю і саме це число
#
# Ваш код повинен використовувати цикл та умови для визначення простоти числа.
#
# Запишіть результат в змінну result.

def is_prime_number(number):
    result = 0
    if number % number == 1:
        result += True
    else:
        result += number

    return result